CheckNHSOAplication/xml-resources/web-service-references/UCWSTokenP1/wsdl/ucws.nhso.go.th/ucwstokenp1/UCWSTokenP1.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.3 (tags/2.3-7528; 2013-04-29T19:34:10+0000) JAXWS-RI/2.2.8 JAXWS/2.2 svn-revision#unknown. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.3 (tags/2.3-7528; 2013-04-29T19:34:10+0000) JAXWS-RI/2.2.8 JAXWS/2.2 svn-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://tokenws.ucws.nhso.go.th/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://tokenws.ucws.nhso.go.th/" name="UCWSTokenP1">
<types>
<xsd:schema>
<xsd:import namespace="http://tokenws.ucws.nhso.go.th/" schemaLocation="http://ucws.nhso.go.th:80/ucwstokenp1/UCWSTokenP1?xsd=1"/>
</xsd:schema>
</types>
<message name="searchCurrentByPID">
<part name="parameters" element="tns:searchCurrentByPID"/>
</message>
<message name="searchCurrentByPIDResponse">
<part name="parameters" element="tns:searchCurrentByPIDResponse"/>
</message>
<portType name="UCWSTokenP1">
<operation name="searchCurrentByPID">
<input wsam:Action="http://tokenws.ucws.nhso.go.th/UCWSTokenP1/searchCurrentByPIDRequest" message="tns:searchCurrentByPID"/>
<output wsam:Action="http://tokenws.ucws.nhso.go.th/UCWSTokenP1/searchCurrentByPIDResponse" message="tns:searchCurrentByPIDResponse"/>
</operation>
</portType>
<binding name="UCWSTokenP1PortBinding" type="tns:UCWSTokenP1">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="searchCurrentByPID">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="UCWSTokenP1">
<port name="UCWSTokenP1Port" binding="tns:UCWSTokenP1PortBinding">
<soap:address location="http://ucws.nhso.go.th:80/ucwstokenp1/UCWSTokenP1"/>
</port>
</service>
</definitions>