public/index.html

<html>
<script src="https://cdn.jsdelivr.net/npm/easy-soap-request/dist/easy-soap-request.js"></script>
<script>
    const url = 'http://ucws.nhso.go.th/ucwstokenp1/UCWSTokenP1?WSDL';
    const sampleHeaders = {
        'Content-Type': 'text/xml;charset=UTF-8',
        SOAPAction: '',
    };
    const xml = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tok="http://tokenws.ucws.nhso.go.th/">
  <soapenv:Header/>
  <soapenv:Body>
     <tok:searchCurrentByPID>
        <!--Optional:-->
        <user_person_id>1839900250118</user_person_id>
        <!--Optional:-->
        <smctoken>t3bk778j5751946u</smctoken>
        <!--Optional:-->
        <person_id>3150300174300</person_id>
     </tok:searchCurrentByPID>
  </soapenv:Body>
</soapenv:Envelope>`;
    async function makeRequest() {
        const { response } = await soapRequest({ url: url, headers: sampleHeaders, xml: xml, timeout: 1000 });
        const { headers, body, statusCode } = response;
        console.log(headers);
        console.log(body);
        console.log(statusCode);
        document.body.innerHTML = body;
    };
    makeRequest();
</script>
<body></body>
</html>